In [2]:
import pandas as pd
import numpy as np

In [6]:
data = pd.read_csv('prison.csv')
data

     Year  Type of Offence        M        F    F%
0    2013              Debt     618       28  4.33
1    2013             Arson     685       14     2
2    2013            Affray    1000       12  1.19
3    2013           Assault    8301      681  7.58
4    2013            Murder    6852      320  4.46
..    ...               ...     ...      ...   ...
119  2016    Cultism/Ritual     401        2   0.5
120  2016   Breach of peace     948       26  2.67
121  2016     Other Offence   25942     1442  5.27
122  2016             Total   36481     6367  4.46
123  2016  Total calculated  136384  6365.83   NaN

[124 rows x 5 columns]

In [7]:
data.head(10)

   Year Type of Offence      M    F     F%
0  2013             Debt   618   28   4.33
1  2013            Arson   685   14      2
2  2013           Affray  1000   12   1.19
3  2013          Assault  8301  681   7.58
4  2013           Murder  6852  320   4.46
5  2013          Treason   387   44  10.21
6  2013         Sedition   183    5   2.66
7  2013        Abduction  1610   79   4.68
8  2013         Smugging   621   15   2.36
9  2013      Immigration   623   15   2.35

In [8]:
data.columns

Index(['Year', 'Type of Offence ', 'M', 'F', 'F%'], dtype='object')

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 124 entries, 0 to 123
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Year              124 non-null    int64
 1   Type of Offence   124 non-null    object
 2   M                 124 non-null    object
 3   F                 124 non-null    object
 4   F%                119 non-null    object
dtypes: int64(1), object(4)
memory usage: 5.0+ KB

In [53]:
data.mean()

Year    2014.5
dtype: float64

In [12]:
data.isnull()

      Year  Type of Offence       M      F     F%
0    False             False  False  False  False
1    False             False  False  False  False
2    False             False  False  False  False
3    False             False  False  False  False
4    False             False  False  False  False
..     ...               ...    ...    ...    ...
119  False             False  False  False  False
120  False             False  False  False  False
121  False             False  False  False  False
122  False             False  False  False  False
123  False             False  False  False   True

[124 rows x 5 columns]

In [47]:
data.isnull().sum()

Year                0
Type of Offence     0
M                   0
F                   0
F%                  5
dtype: int64

In [15]:
DT = data['F%']
DT

0      4.33
1         2
2      1.19
3      7.58
4      4.46
       ...
119     0.5
120    2.67
121    5.27
122    4.46
123     NaN
Name: F%, Length: 124, dtype: object

In [55]:
DT.mean

<bound method NDFrame._add_numeric_operations.<locals>.mean of 0       4.33
1          2
2       1.19
3       7.58
4       4.46
       ...
117    14.46
119      0.5
120     2.67
121     5.27
122     4.46
Name: F%, Length: 119, dtype: object>

In [50]:
F = data['F%'].loc[100:124]
F

100     7.69
101     2.93
102      7.4
103     5.24
104     2.57
105      5.2
106      3.5
107     3.73
108     5.16
109     2.78
110     4.17
111     2.19
112     2.61
113     0.98
114     2.54
115     2.14
116     2.62
117    14.46
118      NaN
119      0.5
120     2.67
121     5.27
122     4.46
123      NaN
Name: F%, dtype: object

In [57]:
data["F%"].fillna(4, inplace = True)
data

     Year  Type of Offence        M        F    F%
0    2013              Debt     618       28  4.33
1    2013             Arson     685       14     2
2    2013            Affray    1000       12  1.19
3    2013           Assault    8301      681  7.58
4    2013            Murder    6852      320  4.46
..    ...               ...     ...      ...   ...
119  2016    Cultism/Ritual     401        2   0.5
120  2016   Breach of peace     948       26  2.67
121  2016     Other Offence   25942     1442  5.27
122  2016             Total   36481     6367  4.46
123  2016  Total calculated  136384  6365.83     4

[124 rows x 5 columns]

In [103]:
data.dropna()

     Year  Type of Offence        M        F    F%
0    2013              Debt     618       28  4.33
1    2013             Arson     685       14     2
2    2013            Affray    1000       12  1.19
3    2013           Assault    8301      681  7.58
4    2013            Murder    6852      320  4.46
..    ...               ...     ...      ...   ...
119  2016    Cultism/Ritual     401        2   0.5
120  2016   Breach of peace     948       26  2.67
121  2016     Other Offence   25942     1442  5.27
122  2016             Total   36481     6367  4.46
123  2016  Total calculated  136384  6365.83     4

[124 rows x 5 columns]

In [79]:
Fd = data['F%']
Fd

0      4.33
1         2
2      1.19
3      7.58
4      4.46
       ...
119     0.5
120    2.67
121    5.27
122    4.46
123       4
Name: F%, Length: 124, dtype: object

In [102]:
x =Fd.mean
x

<bound method NDFrame._add_numeric_operations.<locals>.mean of 0      4.33
1         2
2      1.19
3      7.58
4      4.46
       ...
119     0.5
120    2.67
121    5.27
122    4.46
123       4
Name: F%, Length: 124, dtype: object>

In [105]:
data["F%"].loc[61]

4

#####

In [106]:
data["F%"].loc[92]

4

In [108]:
data["F%"].loc[118]

4

In [109]:
data.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
119    False
120    False
121    False
122    False
123    False
Length: 124, dtype: bool

In [ ]:
#Data cleaning is complete